friedtco/cc13xxware/inc/hw_aon_pmctl.h
/******************************************************************************
*  Filename:       hw_aon_pmctl_h
*  Revised:        2018-05-14 12:24:52 +0200 (Mon, 14 May 2018)
*  Revision:       51990
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_AON_PMCTL_H__
#define __HW_AON_PMCTL_H__

//*****************************************************************************
//
// This section defines the register offsets of
// AON_PMCTL component
//
//*****************************************************************************
// AUX SCE Clock Management
#define AON_PMCTL_O_AUXSCECLK                                       0x00000004

// RAM Configuration
#define AON_PMCTL_O_RAMCFG                                          0x00000008

// Power Management Control
#define AON_PMCTL_O_PWRCTL                                          0x00000010

// AON Power and Reset Status
#define AON_PMCTL_O_PWRSTAT                                         0x00000014

// Shutdown Control
#define AON_PMCTL_O_SHUTDOWN                                        0x00000018

// Recharge Controller Configuration
#define AON_PMCTL_O_RECHARGECFG                                     0x0000001C

// Recharge Controller Status
#define AON_PMCTL_O_RECHARGESTAT                                    0x00000020

// Oscillator Configuration
#define AON_PMCTL_O_OSCCFG                                          0x00000024

// Reset Management
#define AON_PMCTL_O_RESETCTL                                        0x00000028

// Sleep Control
#define AON_PMCTL_O_SLEEPCTL                                        0x0000002C
#define AON_SYSCTL_O_SLEEPCTL                                       AON_PMCTL_O_SLEEPCTL

// JTAG Configuration
#define AON_PMCTL_O_JTAGCFG                                         0x00000034

// JTAG USERCODE
#define AON_PMCTL_O_JTAGUSERCODE                                    0x0000003C

//*****************************************************************************
//
// Register: AON_PMCTL_O_AUXSCECLK
//
//*****************************************************************************
// Field:     [8] PD_SRC
//
// Selects the clock source for the AUX domain when AUX is in powerdown mode.
// Note: Switching the clock source is guaranteed to be glitch-free
// ENUMs:
// SCLK_LF                  LF clock (SCLK_LF )
// NO_CLOCK                 No clock
#define AON_PMCTL_AUXSCECLK_PD_SRC                                  0x00000100
#define AON_PMCTL_AUXSCECLK_PD_SRC_BITN                                      8
#define AON_PMCTL_AUXSCECLK_PD_SRC_M                                0x00000100
#define AON_PMCTL_AUXSCECLK_PD_SRC_S                                         8
#define AON_PMCTL_AUXSCECLK_PD_SRC_SCLK_LF                          0x00000100
#define AON_PMCTL_AUXSCECLK_PD_SRC_NO_CLOCK                         0x00000000

// Field:     [0] SRC
//
// Selects the clock source for the AUX domain when AUX is in active mode.
// Note: Switching the clock source is guaranteed to be glitch-free
// ENUMs:
// SCLK_MF                  MF Clock (SCLK_MF)
// SCLK_HFDIV2              HF Clock divided by 2 (SCLK_HFDIV2)
#define AON_PMCTL_AUXSCECLK_SRC                                     0x00000001
#define AON_PMCTL_AUXSCECLK_SRC_BITN                                         0
#define AON_PMCTL_AUXSCECLK_SRC_M                                   0x00000001
#define AON_PMCTL_AUXSCECLK_SRC_S                                            0
#define AON_PMCTL_AUXSCECLK_SRC_SCLK_MF                             0x00000001
#define AON_PMCTL_AUXSCECLK_SRC_SCLK_HFDIV2                         0x00000000

//*****************************************************************************
//
// Register: AON_PMCTL_O_RAMCFG
//
//*****************************************************************************
// Field:    [17] AUX_SRAM_PWR_OFF
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_RAMCFG_AUX_SRAM_PWR_OFF                           0x00020000
#define AON_PMCTL_RAMCFG_AUX_SRAM_PWR_OFF_BITN                              17
#define AON_PMCTL_RAMCFG_AUX_SRAM_PWR_OFF_M                         0x00020000
#define AON_PMCTL_RAMCFG_AUX_SRAM_PWR_OFF_S                                 17

// Field:    [16] AUX_SRAM_RET_EN
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_RAMCFG_AUX_SRAM_RET_EN                            0x00010000
#define AON_PMCTL_RAMCFG_AUX_SRAM_RET_EN_BITN                               16
#define AON_PMCTL_RAMCFG_AUX_SRAM_RET_EN_M                          0x00010000
#define AON_PMCTL_RAMCFG_AUX_SRAM_RET_EN_S                                  16

// Field:   [3:0] BUS_SRAM_RET_EN
//
// MCU SRAM is partitioned into 5  banks . This register controls which of the
// banks that has retention during MCU Bus domain power off
// ENUMs:
// RET_FULL                 Retention on for all banks SRAM:BANK0, SRAM:BANK1
//                          ,SRAM:BANK2,  SRAM:BANK3  and SRAM:BANK4
// RET_LEVEL3               Retention on for SRAM:BANK0, SRAM:BANK1
//                          ,SRAM:BANK2 and SRAM:BANK3
// RET_LEVEL2               Retention on for SRAM:BANK0, SRAM:BANK1 and
//                          SRAM:BANK2
// RET_LEVEL1               Retention on for SRAM:BANK0 and  SRAM:BANK1
// RET_NONE                 Retention is disabled
#define AON_PMCTL_RAMCFG_BUS_SRAM_RET_EN_W                                   4
#define AON_PMCTL_RAMCFG_BUS_SRAM_RET_EN_M                          0x0000000F
#define AON_PMCTL_RAMCFG_BUS_SRAM_RET_EN_S                                   0
#define AON_PMCTL_RAMCFG_BUS_SRAM_RET_EN_RET_FULL                   0x0000000F
#define AON_PMCTL_RAMCFG_BUS_SRAM_RET_EN_RET_LEVEL3                 0x00000007
#define AON_PMCTL_RAMCFG_BUS_SRAM_RET_EN_RET_LEVEL2                 0x00000003
#define AON_PMCTL_RAMCFG_BUS_SRAM_RET_EN_RET_LEVEL1                 0x00000001
#define AON_PMCTL_RAMCFG_BUS_SRAM_RET_EN_RET_NONE                   0x00000000

//*****************************************************************************
//
// Register: AON_PMCTL_O_PWRCTL
//
//*****************************************************************************
// Field:     [2] DCDC_ACTIVE
//
// Select to use DCDC regulator for VDDR in active mode
//
// 0: Use GLDO for regulation of VDDR in active mode.
// 1: Use DCDC for regulation of VDDR in active mode.
//
// DCDC_EN must also be set for DCDC to be used as regulator for VDDR in active
// mode
#define AON_PMCTL_PWRCTL_DCDC_ACTIVE                                0x00000004
#define AON_PMCTL_PWRCTL_DCDC_ACTIVE_BITN                                    2
#define AON_PMCTL_PWRCTL_DCDC_ACTIVE_M                              0x00000004
#define AON_PMCTL_PWRCTL_DCDC_ACTIVE_S                                       2

// Field:     [1] EXT_REG_MODE
//
// Status of source for VDDRsupply:
//
// 0: DCDC or GLDO are generating VDDR
// 1: DCDC and GLDO are bypassed and an external regulator supplies VDDR
#define AON_PMCTL_PWRCTL_EXT_REG_MODE                               0x00000002
#define AON_PMCTL_PWRCTL_EXT_REG_MODE_BITN                                   1
#define AON_PMCTL_PWRCTL_EXT_REG_MODE_M                             0x00000002
#define AON_PMCTL_PWRCTL_EXT_REG_MODE_S                                      1

// Field:     [0] DCDC_EN
//
// Select to use DCDC regulator during recharge of VDDR
//
// 0: Use GLDO for recharge of VDDR
// 1: Use DCDC for recharge of VDDR
//
// Note: This bitfield should be set to the same as DCDC_ACTIVE
#define AON_PMCTL_PWRCTL_DCDC_EN                                    0x00000001
#define AON_PMCTL_PWRCTL_DCDC_EN_BITN                                        0
#define AON_PMCTL_PWRCTL_DCDC_EN_M                                  0x00000001
#define AON_PMCTL_PWRCTL_DCDC_EN_S                                           0

//*****************************************************************************
//
// Register: AON_PMCTL_O_PWRSTAT
//
//*****************************************************************************
// Field:     [2] JTAG_PD_ON
//
// Indicates JTAG power state:
//
// 0: JTAG is powered off
// 1: JTAG is powered on
#define AON_PMCTL_PWRSTAT_JTAG_PD_ON                                0x00000004
#define AON_PMCTL_PWRSTAT_JTAG_PD_ON_BITN                                    2
#define AON_PMCTL_PWRSTAT_JTAG_PD_ON_M                              0x00000004
#define AON_PMCTL_PWRSTAT_JTAG_PD_ON_S                                       2

// Field:     [1] AUX_BUS_RESET_DONE
//
// Indicates Reset Done from AUX Bus:
//
// 0: AUX Bus is being reset
// 1: AUX Bus reset is released
#define AON_PMCTL_PWRSTAT_AUX_BUS_RESET_DONE                        0x00000002
#define AON_PMCTL_PWRSTAT_AUX_BUS_RESET_DONE_BITN                            1
#define AON_PMCTL_PWRSTAT_AUX_BUS_RESET_DONE_M                      0x00000002
#define AON_PMCTL_PWRSTAT_AUX_BUS_RESET_DONE_S                               1

// Field:     [0] AUX_RESET_DONE
//
// Indicates Reset Done from AUX:
//
// 0: AUX is being reset
// 1: AUX reset is released
#define AON_PMCTL_PWRSTAT_AUX_RESET_DONE                            0x00000001
#define AON_PMCTL_PWRSTAT_AUX_RESET_DONE_BITN                                0
#define AON_PMCTL_PWRSTAT_AUX_RESET_DONE_M                          0x00000001
#define AON_PMCTL_PWRSTAT_AUX_RESET_DONE_S                                   0

//*****************************************************************************
//
// Register: AON_PMCTL_O_SHUTDOWN
//
//*****************************************************************************
// Field:     [0] EN
//
// Shutdown control.
//
// 0: Do not write 0 to this bit.
// 1: Immediately start the process to enter shutdown mode
#define AON_PMCTL_SHUTDOWN_EN                                       0x00000001
#define AON_PMCTL_SHUTDOWN_EN_BITN                                           0
#define AON_PMCTL_SHUTDOWN_EN_M                                     0x00000001
#define AON_PMCTL_SHUTDOWN_EN_S                                              0

//*****************************************************************************
//
// Register: AON_PMCTL_O_RECHARGECFG
//
//*****************************************************************************
// Field: [31:30] MODE
//
// Selects recharge algorithm for VDDR when the system is running on the uLDO
// ENUMs:
// COMPARATOR               External recharge comparator.
//                          Note that the clock to
//                          the recharge comparator must be enabled,
//
// [ANATOP_MMAP:ADI_3_REFSYS:CTL_RECHARGE_CMP0:COMP_CLK_DISABLE],
//                          before selecting  this recharge algorithm.
// ADAPTIVE                 Adaptive timer
// STATIC                   Static timer
// OFF                      Recharge disabled
#define AON_PMCTL_RECHARGECFG_MODE_W                                         2
#define AON_PMCTL_RECHARGECFG_MODE_M                                0xC0000000
#define AON_PMCTL_RECHARGECFG_MODE_S                                        30
#define AON_PMCTL_RECHARGECFG_MODE_COMPARATOR                       0xC0000000
#define AON_PMCTL_RECHARGECFG_MODE_ADAPTIVE                         0x80000000
#define AON_PMCTL_RECHARGECFG_MODE_STATIC                           0x40000000
#define AON_PMCTL_RECHARGECFG_MODE_OFF                              0x00000000

// Field: [23:20] C2
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_RECHARGECFG_C2_W                                           4
#define AON_PMCTL_RECHARGECFG_C2_M                                  0x00F00000
#define AON_PMCTL_RECHARGECFG_C2_S                                          20

// Field: [19:16] C1
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_RECHARGECFG_C1_W                                           4
#define AON_PMCTL_RECHARGECFG_C1_M                                  0x000F0000
#define AON_PMCTL_RECHARGECFG_C1_S                                          16

